test/jmeter/report/statistics.json
{
  "Request POST al Producer" : {
    "transaction" : "Request POST al Producer",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5961999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 100.15925321260805,
    "receivedKBytesPerSec" : 22.301083723119763,
    "sentKBytesPerSec" : 103.09360633407118
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5961999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 100.15925321260805,
    "receivedKBytesPerSec" : 22.301083723119763,
    "sentKBytesPerSec" : 103.09360633407118
  }
}